
import numpy as np
# 创建数组

#一:创建一维数组 方法
#1.直接传入列表
# np.array([1,2,3])

#2. np.arange(起始数据，结束数据，步长)
#np.arange(1,20,2) #[ 1  3  5  7  9 11 13 15 17 19]

#3.使用np.linspace('起始数据','结束数据',num)创建等差数组。num表示需要得到的数据数量。等差会自动计算，不用指定。注意：np.linspace()会默认生成浮点数，如果希望生成的数据是其他的类型可以指定参数dtype的值，比如：dtype=int
#np.linspace(1,10,num=4) #[ 1.  4.  7. 10.] 取1-10以内等，4个等差数

#二.创建二维数组方法
#1.np.array()+嵌套列表  
# np.array([[1,2],[3,4],[5,6]])

#2.列表+元组
# print(np.array([(1,2,5,3),(4,5,6)])) #[(1, 2, 5, 3) (4, 5, 6)]


#三.创建特殊数组
# 1.创建全零数组  np.zeros(shape,dtype=None) shape:表示数组的形状，如果是一维数组则直接写即可，如果是多维数组需要将数据用括号括起来，因为代码会识别第一个地方的数据为形状，如果不用括号会把第2个数据识别成dtype参数的值，就会导致报错

# print(np.zeros(5)) #[0. 0. 0. 0. 0.]
# print(np.zeros((5,3)))
# [
#  [0. 0. 0.]
#  [0. 0. 0.]
#  [0. 0. 0.]
#  [0. 0. 0.]
#  [0. 0. 0.]
# ]

# 2.创建全一数组  函数：np.ones()参数及其含义和np.zeros()一致
# print(np.ones((5,3),dtype=int))
# [
#  [1 1 1]
#  [1 1 1]
#  [1 1 1]
#  [1 1 1]
#  [1 1 1]
# ]

# 3.创建空数组 函数:np.empty()参数及其含义和创建全零数组一致。
#注意事项：
# 1,np.empty())只分配了内存空间，里面的元素是随机的，且数据类型默认为float64
# 2,如果不修改参数值，那么在同一次代码文件中运行的结果将会是一样的
# print(np.empty((3,4)))
# [
#  [6.23042070e-307 4.13183181e+123 4.22789326e-307 3.49319517e+303]
#  [8.45590539e-307 8.06632139e-308 1.78022342e-306 6.23058028e-307]
#  [7.56603881e-307 1.24610723e-306 1.69119873e-306 1.29062229e-306]
# ]
# 
# 
# 生产符合标准正态分别的数组  np.random.randn()
# print(np.random.randn(4,4)) 
# [
#  [-0.18129494 -1.92472931 -0.06908678  1.07799957]
#  [ 0.33027717 -1.27748017  2.50938994 -0.76159222]
#  [ 1.10844269 -0.99975373 -1.10680973  0.43608315]
#  [-1.05254944 -0.78697714 -1.58242716 -0.59987895]
# ]